CSI API ETABS v1
cFunction Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cFunction
Public Interface cFunction
Dim instance As cFunction
public interface class cFunction
type cFunction =  interface end
The cFunction type exposes the following members.
Properties
Name | Description
FuncRS
FuncTH
Top
Methods
Name | Description
ChangeName
ConvertToUser
Count
Delete
GetNameList
GetTypeOAPI
 Retrieves the function type for the specified function
GetValues
Top
See Also
Reference
ETABSv1 Namespace